# Distance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpacingRule..::..Distance Property
SpacingRule Class See Also
---
The exact distance between layout lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Distance { get; set; }
```

Visual Basic
---
```text
Public Property Distance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Distance {
	double get ();
	void set (double value);
}
```

# Remarks
This property is only available when Layout is equal to FixedDistance, MaximumSpacing, or MinimumSpacing. Must be a positive value less than 30000'.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the Layout property is None or FixedNumber. |

# See Also
SpacingRule Class
Autodesk.Revit.DB Namespace